package com.univ.beans;

public class Recommendation {
    private String decision;
    private Influence influence;

    public Recommendation(Place place) {
        decision = "";
        influence = place.getInfluence();
    }

    public String getDecision() {
        if (influence.getRadiation()<=20){
            decision = "На цій території можна проживати, вирощувати рослини і розводити тварин";
        }else if(influence.getRadiation()<=50){
            decision = "На цій території можна жити, розводити тварин, але не бажано вирощувати продукти харчування";
        }else if(influence.getRadiation()<=200){
            decision = "На цій території можна знаходитись до 2-3 днів, не можна перебувати на відкритому повітрі довше ніж 30 хвилин," +
                    " без відповідного захисту. Бажано знаходитись в приміщенні, щільно закривши вікна і двері. При виході на вулицю," +
                    " бажано одягати респіратор і не наближатись до скупчень металів.";
        }else if (influence.getRadiation()<=500){
            decision = "На цій території можна знаходитись до 8-10 годин. Обов'язково потрібно одягнути респіратор, і костюм хімочного захисту, " +
                    "при відсутності останнього, потрібно вдягнути одяг з цупкої тканини який повністю закриватиме тіло, а на руки - рукавиці. " +
                    "Бажано не виходити з приміщення, яке має бути максимально герметиним.";
        }else if (influence.getRadiation()<=1000){
            decision = "На цій території можна знаходитись до 2-4 годин. Обов'язково потрібно одягнути респіратор, і костюм хімочного захисту. При цьому " +
                    "найкраще знайти найближче бомбосховище, яке захищене від радіаційного впливу.";
        }else {
            decision = "Максимально швидко покиньте територію радіаційного зараження, та зверність до найближого медичного центру.";
        }

        return decision;
    }
}